# -*- coding: utf-8 -*-
"""
Даны числа 13 и 7.
Для данных чисел вывести на экран результат математических опепаций над числами.
Считать первым числом - 13, вторым - 7.
Математические операции:
    1) сложение (+)
    2) вычитание (-)
    3) деление (/)
    4) умножение (*)
    5) возведение в степень (**)
    6) целочисленное деление (//) 
    7) остаток от деления (%)
"""
a = 13
b = 7

print(a + b) # 20
print(a - b) # 6
print(a * b) # 91
print(a / b) # 1.8571428571428572
print(a ** b) # 62748517
print(a // b) # 1
print(a % b) # 6