# -*- coding: utf-8 -*-
"""
Стоимость аренды офиса 15000 руб/мес
Рассчитать в переменную сколько это в год (12 месяцев)
Вывести на экран  значение (содержимое) этой переменной с помощью print()
Назовите переменные согласно правилам создания переменных
"""
mountly_pay = 15000
annual_pay = mountly_pay * 12
print(annual_pay) # 180000