# -*- coding: utf-8 -*-
"""
Сохранить в переменную first_name свое имя
Сохранить в переменную middle_name свое отчество
Сохранить в переменную last_name свою фамилию
Создать переменную fio, которая будет состоять из 3-х переменных, соответствующих ФИО
Вывести на экран  значение (содержимое) переменной fio с помощью print() 
"""
first_name = 'Елизавета'
middle_name = 'Евгеньевна'
last_name = 'Романова'
fio = last_name + ' ' + first_name + ' ' + middle_name
print(fio) # Романова Елизавета Евгеньевна