# -*- coding: utf-8 -*-
"""
1. Дан список с месяцами months и пустой список winter (означающий зимнее время года).
2. Используя команду del удалите все весенние месяцы.
3. Выведите список months на экран.
4. Используя метод pop() перенесите из списка months зимние месяца в список winter в порядке Декабрь-Январь-Февраль.
5. Выведите список months на экран.
6. Выведите список winter на экран.
7. Используя метод pop() удалите все осенние месяца из списка months.
8. Выведите список months на экран.
9. Используя метод remove() удалите все летние месяца из списка months.
10. Выведите список months на экран.
"""
# Ваш код ниже
months = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
winter = []

del months[2]
del months[3]
del months[2]

winter.append(months.pop())
winter.append(months.pop(0))
winter.append(months.pop(0))

print(months) # ['Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь']
print(winter) # ['Декабрь', 'Январь', 'Февраль']

months.pop()
months.pop()
months.pop()

print(months) # ['Июнь', 'Июль', 'Август']

months.remove('Июнь')
months.remove('Июль')
months.remove('Август')

print(months) # []