# -*- coding: utf-8 -*-
"""
1. Используя цикл while, напишите программу которая последовательно выводит на экран числа от 3 до 11
    Пример:
        3
        4
        5
        6
        7
        8
        9
        10
        11
"""
i=2
while i<11:
    i+=1
    print(i)