# -*- coding: utf-8 -*-
"""
Установите для каждой переменной значение True или False в зависимости от того,
каким будет результат. Вам необходимо заменить '' на True или False в каждой переменной.

Например, 1 < 2 будет True, потому что 1 меньше, чем 2 (bool_0 = True).
"""
# Ваш код ниже
# 1) Установите bool_1 равным результату 27 < 383
bool_1 = 'true'
print("(1)", "27 < 383 -->", bool_1)
# 2) Установите bool_2 равным результату 150 == (2 * 75)
bool_2 = 'true'
print("(2)", "150 == (2 * 75) -->", bool_2)
# 3) Установите bool_3 равным результату 27 <= 27
bool_3 = 'true'
print("(3)", "27 <= 27 -->", bool_3)
# 4) Установите bool_4 равным результату -23 >= -19
bool_4 = 'false'
print("(4)", "-23 >= -19 -->", bool_4)
# 5) Установите bool_5 равным результату 99 != (98 + 1)
bool_5 = 'false'
print("(5)", "99 != (98 + 1) -->", bool_5)
# 6) Установите bool_6 равным результату (20 - 10) > 15
bool_6 = 'false'
print("(6)", "(20 - 10) > 15 -->", bool_6)
# 7) Установите bool_7 равным результату (10 + 17) == 3**16
bool_7 = 'false'
print("(7)", "(10 + 17) == 3**16 -->", bool_7)
# 8) Установите bool_8 равным результату 1**2 <= -1
bool_8 = 'false'
print("(8)", "1**2 <= -1 -->", bool_8)
# 9) Установите bool_9 равным результату 40 * 4 >= -4
bool_9 = 'true'
print("(9)", "40 * 4 >= -4 -->", bool_9)
# 10) Установите bool_10 равным результату 100 != 10**2
bool_10 = 'false'
print("(10)", "100 != 10**2 -->", bool_10)

"""
Установите для каждой переменной значение True или False при помощи выражения,
используя 6 разных оператора сравнения (==, !=, >, >=, <, <=). Вам необходимо заменить '' на выражение операции сравнения в каждой переменной.
 Например, bool_zero сделать равным True. Решение: bool_zero = (2 + 3) > 4.
"""
# Ваш код ниже
#1) Установите bool_one равным результату True
bool_one = '2**3 == 8'
print("(one)", "bool_one -->", bool_one)
#2) Установите bool_two равным результату False
bool_two = '100 == 10**10'
print("(two)", "bool_two -->", bool_two)
#3) Установите bool_three равным результату True
bool_three = '729/9 == 9**2'
print("(three)", "bool_three -->", bool_three)
#4) Установите bool_four равным результату False
bool_four = 'a <= A'
print("(four)", "bool_four -->", bool_four)
#5) Установите bool_five равным результату True
bool_five = 'a != A'
print("(five)", "bool_five -->", bool_five)
#6) Установите bool_six равным результату False
bool_six = '6**4 == 24'
print("(six)", "bool_six -->", bool_six)