# -*- coding: utf-8 -*-
"""
1. Создайте списки:
    - друзей friends
    - любимых фильмов movies
    - увлечений hobbies
2. Выведите списки friends, movies, hobbies на экран
"""
friends = ['Ann', 'Jill', 'Ken']
print(friends)
movies = ['The Devil Wears Prada', 'Legally Blonde', "Ocean's Eight"]
print(movies)
hobbies = ['webdev', 'learning python', 'youtube']
print(hobbies)