# -*- coding: utf-8 -*-
"""
1. Создайте кортеж full_name, состоящий из трех элементов: Имя, Фамилия, Отчество
2. Выведите на экран содержимое кортежа full_name по одному элементу
"""
# Ваш код ниже
full_name=('Елизавета', 'Романова', 'Евгеньевна')
print(full_name[1])
print(full_name[0])
print(full_name[2])