# -*- coding: utf-8 -*-
"""
1. Создайте словарь rus_eng, используя многострочную запись, в котором ключ - слово на русском языке, значение - перевод на английский язык.
2. Выведите слодержимое словаря rus_eng на экран.
P.S. список слов:
    Солнце - Sun, Дождь - Rain, Облако - Cloud, Радуга - Rainbow, Лед - Ice, Снег - Snow, Лес - Forest, Пасека - Apiary, Море - Sea, Вода - Water, Трава - Grass, Песок - Sand, Пламя - Flame, Камень - Stone, Планета - Planet, Звезда - Star, Вулкан - Volcano, Гора - Mountain
"""

rus_eng = {
    'Солнце': 'Sun',
    'Дождь': 'Rain',
    'Облако': 'Cloud',
    'Радуга': 'Rainbow',
    'Лед': 'Ice', 
    'Снег': 'Snow', 
    'Лес': 'Forest', 
    'Пасека': 'Apiary', 
    'Море': 'Sea', 
    'Вода': 'Water', 
    'Трава': 'Grass', 
    'Песок': 'Sand', 
    'Пламя': 'Flame', 
    'Камень': 'Stone', 
    'Планета': 'Planet', 
    'Звезда': 'Star', 
    'Вулкан': 'Volcano', 
    'Гора': 'Mountain'
}

print(rus_eng)