# -*- coding: utf-8 -*-
"""
1. Создайте словарь hobbies, в который поместите в виде ключей имена трех Ваших друзей (используйте английский язык, например: «Игорь» - «Igor»), а для значений укажите для каждого его хобби
2. Выведите на экран с помощью цикла for и словаря hobby построчно сообщение:

«Мой друг NNN любит HHH!», где NNN - имя друга, HHH - его увлечение
3. Используя имеющийся словарь hobbies и цикл for, выведите на экран сообщение: «Привет, NNN!», где NNN - Имя друга
4. Используя имеющийся словарь hobbies и цикл for, выведите на экран сообщение: HHH - это очень интересно!», где HHH - увлечение друга

"""

# Ваш код ниже
